TEXTS = {
  "required_chat": {
    "message": "🚫 برای استفاده از بات باید در کانال و گروه‌های زیر عضو شوید:",
    "bot_not_joined": "⚠️ ربات در چت {chat_id} ({title}) عضو نیست!",
    "bot_no_access": "❌ دسترسی به چت {chat_id} ({title}) وجود ندارد یا پیدا نشد."
  },
  "main_menu": {
    "title": "از حالت Inline ربات برای دریافت تصویر استفاده کنید 🎀\n\n<b>⚙️ {version}</b>",
    "inline_button": "جستجوی اینلاین 🔎"
  },
  "backtomain": "🔙 بازگشت",
  "dev": "<b>⚡️ Powered By <a href='https://t.me/ZeroBitTeam'>Zero Bit ™</a></b>\n<b>🧑‍💻 Dev : @nimazerobit</b>\n<b>⚙️ {version}</b>",
  "admin": {
    "panel_text": "<b>⚙️ پنل مدیریت</b>\n<b>اعلان کاربر جدید:</b> {user_notify_status}",
    "panel_keyboard": {
      "new_user_active": "👤 غیر فعال کردن اعلان ثبت‌نام",
      "new_user_inactive": "👤 فعال کردن اعلان ثبت‌نام",
      "status": "📊 وضعیت ربات"
    },
    "broadcast": {
      "message": "برای ارسال پیام همگانی، این دستور را روی پیام مورد نظر ریپلای کنید.\nیا یک آیدی عددی بدهید.",
      "result": "✅ <b>ارسال شد</b>\n\n🟢 موفق : {success}\n🔴 ناموفق : {failed}"
    },
    "ban_state_changed": "✅ وضعیت بن کاربر توسط صاحب ربات تغییر کرد",
    "setting_saved": "✅ تنظیمات ذخیره شد",
    "user_info": "<b>ℹ️ اطلاعات کاربر</b>\n\n<b>• شناسه:</b> <code>{user_id}</code>\n<b>• یوزرنیم:</b> @{username}\n<b>• نام:</b> {full_name}\n<b>• هش:</b> <code>{user_hash}</code>\n<b>• ثبت‌نام:</b> {created_at} <i>({created_ago} پیش)</i>\n<b>• آخرین فعالیت:</b> {last_active} <i>({last_ago} پیش)</i>\n<b>• وضعیت:</b> {status}",
    "status_result": "<b>📊 آمار ربات</b>\n• کل کاربران: <b>{total_users}</b>\n• کاربران بن شده: <b>{banned_users}</b>\n• کاربران فعال امروز: <b>{today_active}</b>",
    "backtomenu": "🔙 بازگشت به پنل"
  },
  "animebot": {
    "message": "🎀 کاراکتر رندوم شما 🎀\n\n<blockquote>تگ ها:\n{tags}</blockquote>",
  },
  "errors": {
    "access_denied": "⚠️ شما دسترسی لازم ندارید",
    "banned": "⛔️ دسترسی شما مسدود است",
    "invalid_command": "⚠️ فرمت دستور درست نیست",
    "db_error": "⚠️ خطای داخلی. لطفاً دوباره تلاش کن یا به پشتیبانی پیام بده",
    "user_notfound": "⚠️ کاربر یافت نشد",
    "unexpected_error": "🚫 خطایی رخ داد. لطفا بعداً تلاش کنید."
  }
}